# Concatenaciones de dataframes
Concatenar =jutar, unir o fusionar

Para dataframes existe 3 formas de concatenar:
- Concat(concatenar)
- merge(fusionar)
- join(unir)

# Concat
 Esta técnica básicamente se centra en bases de datos comunes, tienen las mismas columnas por lo tanto básicamente hay que juntar las filas

In [10]:
import pandas as pd
df1= pd.DataFrame({'A':['1A','2A'],'B':['1B','2B'], 'C':['1C','2C'],'K':['1K','2K']})
df2= pd.DataFrame({'A':['6A','7A','8A'],'B':['6B','7B','8B'], 'C':['6C','7C','8C']})

In [2]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp311-cp311-win_amd64.whl (11.3 MB)
     --------------------------------------- 11.3/11.3 MB 32.8 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.23.2 in c:\users\v304-16\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\v304-16\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\v304-16\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\v304-16\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\v304-16\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Installing collected packages: pandas
Successfully installed pandas-2.3.3

[notice] A new release of pip available: 22.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
df1

    A   B   C
0  1A  1B  1C
1  2A  2B  2C

In [6]:
df2

    A   B   C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [11]:
pd.concat([df1,df2]) # lista de dataframes para concatenar

    A   B   C    K
0  1A  1B  1C   1K
1  2A  2B  2C   2K
0  6A  6B  6C  NaN
1  7A  7B  7C  NaN
2  8A  8B  8C  NaN

In [12]:
pd.concat([df1,df2],ignore_index=True)

    A   B   C    K
0  1A  1B  1C   1K
1  2A  2B  2C   2K
2  6A  6B  6C  NaN
3  7A  7B  7C  NaN
4  8A  8B  8C  NaN

# Merge(fusionar)
Esta técnica fusiona diferentes dataframes a partir de una columna (clave) en común

In [13]:
df1= pd.DataFrame({'A':['1A','2A'],'B':['1B','2B']})
df2= pd.DataFrame({'A':['1A','2A'], 'C':['1C','2C'],'K':['1K','2K']})

In [14]:
df1

    A   B
0  1A  1B
1  2A  2B

In [15]:
df2

    A   C   K
0  1A  1C  1K
1  2A  2C  2K

In [16]:
pd.merge(df1,df2,on=['A']) # especificar que columna tomar como pivote, complemeta con demás columnas, solo cuando coinciden perfectamente

    A   B   C   K
0  1A  1B  1C  1K
1  2A  2B  2C  2K

In [18]:
df1= pd.DataFrame({'A':['1A','2A','3A'],'B':['1B','2B','3B']})
df2= pd.DataFrame({'A':['5A','6A'], 'C':['1C','2C'],'K':['1K','2K']})

pd.merge(df1,df2,on=['A'], how='outer') # AGARRA todos los valores incluso si no lo tienen en común, logica de diagrama de venn

    A    B    C    K
0  1A   1B  NaN  NaN
1  2A   2B  NaN  NaN
2  3A   3B  NaN  NaN
3  5A  NaN   1C   1K
4  6A  NaN   2C   2K

In [19]:
pd.merge(df1,df2,on=['A'], how='inner')

Empty DataFrame
Columns: [A, B, C, K]
Index: []

In [20]:
pd.merge(df1,df2,on=['A'], how='left')

    A   B    C    K
0  1A  1B  NaN  NaN
1  2A  2B  NaN  NaN
2  3A  3B  NaN  NaN

# Join
La idea de este dataframe es combinar las columnas de dos dataframes indexados

In [21]:
df1= pd.DataFrame({'Z':['1A','2A','3A'],'B':['1B','2B','3B']},index=['i1','i2','i3'])
df2= pd.DataFrame({'A':['5A','6A'], 'C':['1C','2C'],'K':['1K','2K']},index=['i1','i2'])

In [22]:
df1

     Z   B
i1  1A  1B
i2  2A  2B
i3  3A  3B

In [23]:
df2

     A   C   K
i1  5A  1C  1K
i2  6A  2C  2K

In [24]:
df1.join(df2)

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3B  NaN  NaN  NaN

# Entradas y salidas
 ficheros= archivo con información, cualquier extensión

In [26]:
df3=df1.join(df2)
df3

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3B  NaN  NaN  NaN

In [28]:
df3.to_csv('nombre.csv',index=False)

In [29]:
pd.read_csv('otra_cosa.csv') # si quieres abrir un archivo fuera de la carpeta copias y pegas la direccion(r'dirección')

    Z   B    A    C    K
0  1A  1B   5A   1C   1K
1  2A  2B   6A   2C   2K
2  3A  3B  NaN  NaN  NaN